// 龙宫 普陀山 五庄观 天宫 凌波城 花果山
// 大唐官府 化生寺 方寸山 女儿村 神木林 天机城
// 狮驼岭 魔王寨 阴曹地府 盘丝洞 无底洞 女魃墓
export const personData = [
	{
		race: '人族',
		name: '剑侠客',
		info: '霜刃露锋芒，飒沓如流星。剑侠客率情任性，狂放不羁。一生淡泊名利，嗜武成痴。英雄意，儿女情，独闯江湖半生醉，举杯邀月最销魂。',
		sex: '男',
		weaponName: '剑',
		sectName: '大唐官府',
		level: 90,
		img: 'src/assets/mhxy/FYN.png'
	},
	{
		race: '人族',
		name: '逍遥生',
		info: '快意恩仇事，把酒踏歌行。一袭白衫，一纸折扇，逍遥生风流倜傥，潇洒自如，行事光明磊落，是世人乐于结交的谦谦君子。',
		sex: '男',
		weaponName: '扇',
		sectName: '神木林',
		level: 71,
		img: 'src/assets/mhxy/XYS.png'
	},
	{
		race: '人族',
		name: '漠少君',
		info: '信轩昂凌云志，文成武德功。漠少君潇洒闲雅，心雄胆大。胸怀家国西北望，愿执牛耳起东风。意难平，归有程，旌钺既张火光红。信是人中龙。息',
		sex: '男',
		weaponName: '弯刀',
		sectName: '化生寺',
		level: 72
		// img: 'src/assets/mhxy/FYN.png'
	},
	{
		race: '人族',
		name: '英女侠',
		info: '兰心蕙质出名门，英姿飒爽自芳华。英女侠天资聪颖，精通琴棋书画，心怀仁爱，行善不落人后，是位侠骨柔情的奇女子。',
		sex: '女',
		weaponName: '双剑',
		sectName: '女儿村',
		level: 74,
		img: 'src/assets/mhxy/YNX.png'
	},
	{
		race: '人族',
		name: '巫蛮儿',
		info: '嫣然巧笑踏绿萝，一路银铃一路歌。巫蛮儿质朴单纯，灵动可人，生性善良，活泼可爱。花盈翠影出神木，环佩婉转披香来。',
		sex: '女',
		weaponName: '法杖',
		sectName: '方寸山',
		level: 76
		// img: 'src/assets/mhxy/FYN.png'
	},
	{
		race: '人族',
		name: '飞燕女',
		info: '深山有佳人，灼灼芙蓉姿。飞燕女轻盈飘逸，灵慧动人，自幼怜爱弱小，嫉恶如仇，一生自由自在，是大自然娇纵的宠儿',
		sex: '女',
		weaponName: '环圈',
		sectName: '天机城',
		level: 75,
		img: 'src/assets/mhxy/FYN.png'
	},

	{
		race: '仙族',
		name: '龙太子',
		info: '乘风破浪翔碧海，腾云驾雾上青天。禀承龙族之血统，生性争强好胜，桀骜不驯。龙太子凭借天生的优势领悟仙法精髓，是当之无愧的龙族骄子。',
		sex: '男',
		weaponName: '枪',
		sectName: '龙宫',
		level: 76,
		img: 'src/assets/mhxy/LTZ.png'
	},
	{
		race: '仙族',
		name: '神天兵',
		info: '金甲腾云受天命，神锤破逆卫灵霄。神天兵风采鹰扬，锋芒毕露，守护天庭立天威，所向披靡，妖魔皆闻风丧胆。',
		sex: '男',
		weaponName: '锤',
		sectName: '月宫',
		level: 77,
		img: 'src/assets/mhxy/STB.png'
	},
	{
		race: '仙族',
		name: '羽灵神',
		info: '游侠红尘里，豪情动九天。羽灵神热情正直，率性豁达，交游遍天下。乐见四海尽升平，愿引凤鸣遍九州。',
		sex: '男',
		weaponName: '降妖杵',
		sectName: '五庄观',
		level: 78,
		img: 'src/assets/mhxy/YLS.png'
	},
	{
		race: '仙族',
		name: '舞天姬',
		info: '霓裳曳广带，飘拂升天行。舞天姬明眸珠辉，瑰姿艳逸，生性善解人意，令人如沐春风。一舞绡丝动四方，观之心魂俱醉。',
		sex: '女',
		weaponName: '飘带',
		sectName: '凌波城',
		level: 79,
		img: 'src/assets/mhxy/WTJ01.png'
	},
	{
		race: '仙族',
		name: '玄彩娥',
		info: '桂露对仙娥，星星下云逗。玄彩娥在花丛中蝶翼翩翩，婀娜曼妙。犹如晨露新聚，奇花初蕊，是集天地灵气于一身的百花仙子。',
		sex: '女',
		weaponName: '魔棒',
		sectName: '普陀山',
		level: 80,
		img: 'src/assets/mhxy/XCE.png'
	},

	{
		race: '魔族',
		name: '杀破狼',
		info: '一啸生风雪，长歌动寒霜。杀破狼飘逸潇洒，气宇轩昂，能文能武，卓尔不群，身具神秘的天狼血统，纵横骄天下，傲立三界间。',
		sex: '男',
		weaponName: '弓',
		sectName: '阴曹地府',
		level: 81,
		img: 'src/assets/mhxy/SPL.png'
	},
	{
		race: '魔族',
		name: '虎头怪',
		info: '戏谑顽劣犹可爱，虽有神力不欺人。虎头怪弯弧五百步，长戟八十斤，勇武过人。生性耿直豁达，对朋友忠肝义胆，是顶天立地的大丈夫。',
		sex: '男',
		weaponName: '斧钺',
		sectName: '狮驼岭',
		level: 82,
		img: 'src/assets/mhxy/HTG01.png'
	},
	{
		race: '魔族',
		name: '巨魔王',
		info: '一怒震乾坤，杀气凝如山。巨魔王力拔山兮气盖世，肩负魔族的神秘使命，叱咤风云，威风凛凛。',
		sex: '男',
		weaponName: '长刀',
		sectName: '魔王寨',
		level: 83,
		img: 'src/assets/mhxy/JMW.png'
	},
	{
		race: '魔族',
		name: '骨精灵',
		info: '眉黛春山秀，横波剪秋水。骨精灵娇妍俏皮，顾盼神飞，机敏聪慧，好打不平，对世间万物充满好奇。',
		sex: '女',
		weaponName: '爪刺',
		sectName: '小雷音',
		level: 84,
		img: 'src/assets/mhxy/GJL.png'
	},
	{
		race: '魔族',
		name: '狐美人',
		info: '修眉连娟，斜挑入鬓，媚眼如丝，含娇含笑。狐美人柔情绰态，胜似海棠醉日，风情万种，颠倒众生。',
		sex: '女',
		weaponName: '鞭',
		sectName: '盘丝洞',
		level: 85,
		img: 'src/assets/mhxy/HMR01.png'
	}
]
// 梦灵珑是一个比较特殊的角色，灵珑双姝，仙魔双体，亦仙亦魔，可选门派较多，龙宫、普陀山、月宫、阴曹地府、狮驼岭、魔王寨、小雷音都可以选，擅使兵器宝珠。
// 梦灵珑：网络图
// 人族角色
// 【剑侠客】（人族男性）
// 霜刃露锋芒，飒沓如流星。剑侠客率情任性，狂放不羁。一生淡泊名利，嗜武成痴。英雄意，儿女情，独闯江湖半生醉，举杯邀月最销魂。
// 擅使兵器：剑
// 可选门派：大唐官府、方寸山、化生寺

// 【巫蛮儿】（人族女性）
// 嫣然巧笑踏绿萝，一路银铃一路歌。巫蛮儿质朴单纯，灵动可人，生性善良，活泼可爱。花盈翠影出神木，环佩婉转披香来。
// 擅使兵器：法杖
// 可选门派：大唐官府、方寸山、化生寺、女儿村

// 【飞燕女】（人族女性）
// 深山有佳人，灼灼芙蓉姿。飞燕女轻盈飘逸，灵慧动人，自幼怜爱弱小，嫉恶如仇，一生自由自在，是大自然娇纵的宠儿
// 擅使兵器：环圈
// 可选门派：大唐官府、方寸山、化生寺、女儿村

// 【逍遥生】（人族男性）
// 快意恩仇事，把酒踏歌行。一袭白衫，一纸折扇，逍遥生风流倜傥，潇洒自如，行事光明磊落，是世人乐于结交的谦谦君子。
// 擅使兵器：扇
// 可选门派：大唐官府、方寸山、化生寺

// 【英女侠】（人族女性）
// 兰心蕙质出名门，英姿飒爽自芳华。英女侠天资聪颖，精通琴棋书画，心怀仁爱，行善不落人后，是位侠骨柔情的奇女子。
// 擅使兵器：双剑
// 可选门派：大唐官府、方寸山、化生寺、女儿村

// 【漠少君】（人族男性）
// 轩昂凌云志，文成武德功。漠少君潇洒闲雅，心雄胆大。胸怀家国西北望，愿执牛耳起东风。意难平，归有程，旌钺既张火光红。信是人中龙。
// 擅使兵器：弯刀
// 可选门派：大唐官府、方寸山、化生寺

// 仙族角色有：
// 【龙太子】（仙族男性）
// 乘风破浪翔碧海，腾云驾雾上青天。禀承龙族之血统，生性争强好胜，桀骜不驯。龙太子凭借天生的优势领悟仙法精髓，是当之无愧的龙族骄子。
// 擅使兵器：枪
// 可选门派：龙宫、普陀山、月宫

// 【玄彩娥】（仙族女性）
// 桂露对仙娥，星星下云逗。玄彩娥在花丛中蝶翼翩翩，婀娜曼妙。犹如晨露新聚，奇花初蕊，是集天地灵气于一身的百花仙子。
// 擅使兵器：魔棒
// 可选门派：龙宫、普陀山、月宫

// 【神天兵】（仙族男性）
// 金甲腾云受天命，神锤破逆卫灵霄。神天兵风采鹰扬，锋芒毕露，守护天庭立天威，所向披靡，妖魔皆闻风丧胆。
// 擅使兵器：锤
// 可选门派：龙宫、普陀山、月宫

// 【舞天姬】（仙族女性）
// 霓裳曳广带，飘拂升天行。舞天姬明眸珠辉，瑰姿艳逸，生性善解人意，令人如沐春风。一舞绡丝动四方，观之心魂俱醉。
// 擅使兵器：飘带
// 可选门派：龙宫、普陀山、月宫

// 【羽灵神】（仙族男性）
// 游侠红尘里，豪情动九天。羽灵神热情正直，率性豁达，交游遍天下。乐见四海尽升平，愿引凤鸣遍九州。
// 擅使兵器：降妖杵
// 可选门派：龙宫、普陀山、月宫

// 【杀破狼】（魔族男性）
// 一啸生风雪，长歌动寒霜。杀破狼飘逸潇洒，气宇轩昂，能文能武，卓尔不群，身具神秘的天狼血统，纵横骄天下，傲立三界间。
// 擅使兵器：弓
// 可选门派：阴曹地府、狮驼岭、魔王寨、小雷音

// 【骨精灵】（魔族女性）
// 眉黛春山秀，横波剪秋水。骨精灵娇妍俏皮，顾盼神飞，机敏聪慧，好打不平，对世间万物充满好奇。
// 擅使兵器：爪刺
// 可选门派：阴曹地府、狮驼岭、魔王寨、小雷音

// 【虎头怪】（魔族男性）
// 戏谑顽劣犹可爱，虽有神力不欺人。虎头怪弯弧五百步，长戟八十斤，勇武过人。生性耿直豁达，对朋友忠肝义胆，是顶天立地的大丈夫。
// 擅使兵器：斧钺
// 可选门派：阴曹地府 [4] 、狮驼岭、魔王寨、小雷音

// 【狐美人】（魔族女性）
// 修眉连娟，斜挑入鬓，媚眼如丝，含娇含笑。狐美人柔情绰态，胜似海棠醉日，风情万种，颠倒众生。
// 擅使兵器：鞭
// 可选门派：阴曹地府、狮驼岭、魔王寨、小雷音

// 【巨魔王】（魔族男性）
// 一怒震乾坤，杀气凝如山。巨魔王力拔山兮气盖世，肩负魔族的神秘使命，叱咤风云，威风凛凛。
// 擅使兵器：长刀
// 可选门派：阴曹地府、狮驼岭、魔王寨、小雷音
