export const beastData = [
	{
		race: '神兽',
		name: '剑侠客',
		info: '生性聪敏活泼，精灵可爱，和其它三界神兽一样有着超凡神奇的能力，成为无数剑客豪侠梦寐以求的宠物。',
		weaponName: '剑',
		sectName: '大唐官府',
		level: 90
	},
	{
		race: '神兽',
		name: '超级神虎',
		info: '因多次为人世间立功，玉帝特在额前点下“王”字，统管百兽。凡生肖属虎寅之人，外见宽容，内心刚强，好勇好誉之性，有侠义之心。',
		weaponName: '扇',
		sectName: '大唐官府',
		level: 71
	},
	{
		race: '神兽',
		name: '超级大熊猫',
		info: '因多次为人世间立功，玉帝特在额前点下“王”字，统管百兽。凡生肖属虎寅之人，外见宽容，内心刚强，好勇好誉之性，有侠义之心。',
		weaponName: '弯刀',
		sectName: '化生寺',
		level: 72
	},
	{
		race: '神兽',
		name: '超级金猴',
		info: '生性聪敏活泼，精灵可爱，和其它三界神兽一样有着超凡神奇的能力，成为无数剑客豪侠梦寐以求的宠物。',
		weaponName: '双剑',
		sectName: '女儿村',
		level: 74
	},
	{
		race: '神兽',
		name: '超级人参娃娃',
		info: '原本是瑶池神山中的一颗人参草，汲取了天地之灵气，修炼千年炼得人形，王母娘娘看其聪明可爱，特令下凡三界，普济众生。',
		weaponName: '法杖',
		sectName: '方寸山',
		level: 76
	},
	{
		race: '神兽',
		name: '超级大象',
		info: '生性聪敏活泼，精灵可爱，和其它三界神兽一样有着超凡神奇的能力，成为无数剑客豪侠梦寐以求的宠物。',
		weaponName: '环圈',
		sectName: '化生寺',
		level: 75
	},

	{
		race: '神兽',
		name: '超级筋斗云',
		info: '原本是齐天大圣孙悟空脚下的筋斗云，汲取了灵猴仙气，习得幻化之术，孙悟空修得正果，佛祖令其下凡三界，继续修行。',
		weaponName: '枪',
		sectName: '龙宫',
		level: 76
	},
	{
		race: '神兽',
		name: '超级灵狐',
		info: '原本是王母娘娘灵兽山中的一只小狐，因机缘巧合吞食蟠桃仙核，汲取了桃内仙气，王母娘娘为锤炼初开心智，令其下凡三界。',
		weaponName: '锤',
		sectName: '月宫',
		level: 77
	},
	{
		race: '神兽',
		name: '超级孔雀',
		info: '原本是观音姐姐紫竹林中灵气汇集而成的天然灵物，观音姐姐观其有此番造化，令下凡三界修行，普济众生。',
		weaponName: '降妖杵',
		sectName: '龙宫',
		level: 78
	},
	{
		race: '神兽',
		name: '超级神龙',
		info: '超级神龙，华夏图腾，万兽之首。能大能小，能升能隐；大则兴云吐雾，小则隐介藏形；升则飞腾于宇宙之间，隐则潜伏于波涛之内。王者气象，吉祥化身，更是炎黄子孙心中的魂！另凡生肖属龙之人，具大智慧，为人亲切，颇具幸运。',
		weaponName: '飘带',
		sectName: '月宫',
		level: 79
	},
	{
		race: '神兽',
		name: '超级神马',
		info: '吉祥如意的象征，代表着一往无前、自强不息的精神，能助人马到功成！凡生肖属马之人，往往秉性正直、热情开朗、坚韧不拔、勇往直前。',
		weaponName: '魔棒',
		sectName: '普陀山',
		level: 80
	},

	{
		race: '神兽',
		name: '超级麒麟',
		info: '本是镇守天庭灵兽山的守护兽，因镇守灵兽山多年，劳苦功高，王母娘娘赐其自由之身，下凡三界进行游历。',
		weaponName: '弓',
		sectName: '阴曹地府',
		level: 81
	},
	{
		race: '神兽',
		name: '超级神蛇',
		info: '十二生肖中最顽强的属相，曾传女娲氏族，也以其形象做为图腾崇拜，可见其强大！凡生肖属蛇之人，勇敢、亲切、顽强。',
		weaponName: '斧钺',
		sectName: '狮驼岭',
		level: 82
	},
	{
		race: '神兽',
		name: '超级青鸾',
		info: '原本是仙界取食传信的神鸟，因劳苦功高，得王母娘娘特许下凡修行，游历三界。',
		weaponName: '长刀',
		sectName: '魔王寨',
		level: 83
	},
	{
		race: '神兽',
		name: '超级灵鹿',
		info: '外表柔弱，却法力高强，禀性正直。我本是极乐净土中的普通仙鹿，后来奉佛祖之命，来到三界，观照众生，惩恶扬善。',
		weaponName: '爪刺',
		sectName: '小雷音',
		level: 84
	},
	{
		race: '神兽',
		name: '超级白泽',
		info: '生于天地未分之际，长于宇宙混沌之时，通今晓古，洞悉鬼神妖精。当年黄帝以此询问，得以了解天下形势。',
		weaponName: '鞭',
		sectName: '魔王寨',
		level: 85
	}
]
// 超级泡泡
// 超级神虎
// 超级大熊猫
// 超级金猴
// 超级人参娃娃
// 超级大象
// 超级筋斗云
// 超级灵狐
// 超级孔雀
// 超级神龙
// 超级神马
// 超级麒麟
// 超级神蛇
// 超级青鸾
// 超级灵鹿
// 超级白泽

// 超级赤焰兽
// 超级大鹏
// 超级神牛
// 超级海豚
// 超级神兔
// 超级神羊
// 超级六耳猕猴
// 超级土地公公
// 超级神猴
// 超级神鸡
// 超级玉兔
// 超级神狗
// 超级小白龙

// 超级神猪

// 超级飞天

// 超级神鼠

// 超级鲲鹏

// 超级离火兽

// 超级神牛（辛丑）

// 超级猪小戒

// 超级有熊

// 超级神虎（壬寅）
